0.57.2119-1/Catalogs/ККСНГ_Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУчастникаЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>47</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючДоступаAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПодпискиСК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНастройкиОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособАвторизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ККСНГ_СпособыАвторизацииКурьер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногопользовательскийРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемыйМодуль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикПослеФормированияЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособАвторизации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ККСНГ_СпособыАвторизацииКурьер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь1С</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючДоступаAPI</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/Enums/ККСНГ_СпособыАвторизацииКурьер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ККСНГ_СпособыАвторизацииКурьер</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ApiKey</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТокенСбербанка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_Организации/Forms/ФормаНастройкиОрганизации/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Варианты настроек обмена ФНС
	ВариантыНастроекОбмена = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВариантыФорматовЭлектронныхДокументов();
	Для Каждого НекийФормат Из ВариантыНастроекОбмена Цикл
		
		Элементы.СписокВариантовНастроекОбмена.СписокВыбора.Добавить(НекийФормат);
		Если Не ЗначениеЗаполнено(ЭтотОбъект.ВариантНастройкиОбмена) Тогда
			ЭтотОбъект.ВариантНастройкиОбмена = НекийФормат;
		КонецЕсли;
		
	КонецЦикла;
	
	// Устанавливаем ограничение типов для реквизитов
	МодульККСНГ_ПМ_РаботаСМетаданными = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданными");
	
	Если Не МодульККСНГ_ПМ_РаботаСМетаданными = Неопределено Тогда
		МодульККСНГ_ПМ_РаботаСМетаданными.УстановитьОграничениеТипа(Элементы.Склад, "Склады");
		Элементы.Склад.Видимость = Элементы.Склад.ОграничениеТипа.Типы().Количество();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьИнтерфейс();
	НастроитьВидимостьПоСпособуАвторизации();
	ОбновитьЦветЭлементовСогласноВариантуОтправки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Организация1СПриИзменении(Элемент)
	
	ТекстПредупреждения = ТекстПредупрежденияОрганизация(Организация1С, ИНН, КПП);
	ВыводитьПредупреждение = Не ПустаяСтрока(ТекстПредупреждения);
	
	Если ВыводитьПредупреждение Тогда
	    Элементы.ДекорацияПредупреждениеОрганизация.Заголовок = ТекстПредупреждения;
	КонецЕсли;
	
	Элементы.ДекорацияПредупреждениеОрганизация.Видимость = ВыводитьПредупреждение;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВариантовНастроекОбменаПриИзменении(Элемент)
	
	ОбновитьЦветЭлементовСогласноВариантуОтправки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаДалее(Команда)
	
	ТекСтраница = Элементы.СтраницыФормы.ТекущаяСтраница;
	Если ТекСтраница = Элементы.СтраницаШаг1 Тогда
		ОбработатьШаг1();
	ИначеЕсли ТекСтраница = Элементы.СтраницаШаг2 Тогда
		ОбработатьШаг2();
	ИначеЕсли ТекСтраница = Элементы.СтраницаШаг3 Тогда
		ОбработатьШаг3();
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШаг1()
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(СпособАвторизации) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните, пожалуйста, способ авторизации.", , "СпособАвторизации");
		Возврат;
	КонецЕсли;
	
	Если ЭтоАвторизацияApiKey() И Не ЗначениеЗаполнено(КлючДоступаAPI) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните, пожалуйста, ключ доступа API.", , "КлючДоступаAPI");
		Возврат;
	КонецЕсли;
	
	НужнаНастройка = (СпособАвторизации <> ПрежнийСпособАвторизации) Или (КлючДоступаAPI <> ПрежнийКлючДоступаAPI);
	
	Если НужнаНастройка Или Не Элементы.ДекорацияНастройкиУспешны.Видимость Тогда
		ОчиститьРезультатыСозданияНастроек();
		НачатьАутентификацию();
	Иначе 
		ПерейтиНаСтраницу(Элементы.СтраницаШаг2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОбработкуШага1(РезультатАутентификации)
	
	УстановитьКартинкуЭтапаНастроек("Аутентификация", РезультатАутентификации.ТекстОшибки);
	Если Не РезультатАутентификации.Успех Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыАвторизации = РезультатАутентификации.ПараметрыАвторизации;
	
	СделатьПаузу(1, "ПродолжитьОбработкуШагаПолучениеСведенийОрганизации");
			
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОбработкуШагаПолучениеСведенийОрганизации() Экспорт
	
	РезультатПолученияСведений = ПолученыСведенияОбОрганизации(ПараметрыАвторизации);		
	УстановитьКартинкуЭтапаНастроек("СведенияОбОрганизации", РезультатПолученияСведений.ТекстОшибки);
	
	Если РезультатПолученияСведений.Успех Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РезультатПолученияСведений, "КодУчастникаЭДО, НаименованиеОрганизации, ИдентификаторСК, ИНН, КПП");
		ОтобразитьИННКППКурьер();
		СделатьПаузу(1, "ПродолжитьОбработкуШагаПроверкаУникальности");
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПродолжитьОбработкуШагаПроверкаУникальности() Экспорт
	
	Элементы.ГруппаПолученныеСведенияСВыравниванием.Видимость = Истина;
	РезультатПроверкиУникальности = УникальностьОрганизацииСфераКурьер(ИдентификаторСК);
	
	Если РезультатПроверкиУникальности.Успех Тогда
		
		УстановитьКартинкуЭтапаНастроек("ПроверкаУникальности", "");
		
		Если ЭтоАвторизацияApiKey() Тогда
			СделатьПаузу(1, "ПродолжитьОбработкуШагаПоискСертификатЭП");
		Иначе
			Элементы.ДекорацияНастройкиУспешны.Видимость = Истина;
			СделатьПаузу(1, "ПродолжитьОбработкуШагаЗавершениеШага1");
		КонецЕсли;
		
	Иначе
		
		НавигационнаяСсылкаПрофиля = ПолучитьНавигационнуюСсылку(РезультатПроверкиУникальности.Ссылка);
		ФорматированнаяСтрока = Новый ФорматированнаяСтрока(РезультатПроверкиУникальности.Представление, , , , НавигационнаяСсылкаПрофиля);
							
		ЧастиСообщения = Новый Массив;
		ЧастиСообщения.Добавить("Найдена уже настроенная организация ");
		ЧастиСообщения.Добавить(ФорматированнаяСтрока);
		ЧастиСообщения.Добавить(" с таким же идентификатором (" + ИдентификаторСК + ").");
		
		УстановитьКартинкуЭтапаНастроек("ПроверкаУникальности", Новый ФорматированнаяСтрока(ЧастиСообщения));
		
	КонецЕсли;			
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОбработкуШагаПоискСертификатЭП() Экспорт
	НайтиСертификатЭП("");	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОбработкуШагаЗавершениеШага1() Экспорт
	ЗавершитьШаг1(КодВозвратаДиалога.Да);
КонецПроцедуры

&НаКлиенте
Процедура НайтиСертификатЭП(ПрежнийКодОшибки = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыАвторизации.СертификатЭП) Тогда
		
		РезультатДополнения = ККСНГ_ДокументооборотКлиент.ДополнитьПараметрыАвторизацииСертификатомЭП(ПараметрыАвторизации);
		Если Не РезультатДополнения.Успех Тогда 
			
			ОбрабатываемыеОшибки = ККСНГ_ЭлектроннаяПодписьКлиентСервер.ОшибкиСертификатаКлючаЭП();
			ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(РезультатДополнения.Журнал);
			Если ПоследняяОшибка <> Неопределено И
				ПоследняяОшибка.КодОшибки <> ПрежнийКодОшибки И
				ПоследняяОшибка.КодОшибки <> ОбрабатываемыеОшибки["ОшибкаЗапросаАктивногоСертификата"] Тогда
				
				ПараметрыНастройкиЭП = Новый Структура;
				ПараметрыНастройкиЭП.Вставить("КодОшибки", ПоследняяОшибка.КодОшибки);
				ДанныеАктивногоСертификата = РезультатДополнения.Результат;
				ПараметрыНастройкиЭП.Вставить("ДанныеАктивногоСертификата", ДанныеАктивногоСертификата);
				
				ДопПараметры = Новый Структура;
				ДопПараметры.Вставить("РезультатДополнения", РезультатДополнения);
				ДопПараметры.Вставить("ПрежнийКодОшибки", ПоследняяОшибка.КодОшибки);
				
				ОповещениеПослеНастройки = Новый ОписаниеОповещения("ПослеНастройкиСертификатаЭП", ЭтотОбъект, ДопПараметры); 
				
				ОткрытьФорму("ОбщаяФорма.ККСНГ_НастройкаСертификатаЭП", ПараметрыНастройкиЭП, ЭтотОбъект,
					Истина, , , ОповещениеПослеНастройки, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
			Иначе 
				ОбработатьОшибкуПолученияСертификатаЭП(РезультатДополнения);
			КонецЕсли;
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Сертификат = ПараметрыАвторизации.СертификатЭП;
	УстановитьКартинкуЭтапаНастроек("ПолучениеСертификатаЭП", "", Ложь);
	Элементы.ДекорацияНастройкиУспешны.Видимость = Истина;
	СделатьПаузу(1, "ПродолжитьОбработкуШагаЗавершениеШага1");

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОшибкуПолученияСертификатаЭП(РезультатДополнения) 
	
	ОбрабатываемыеОшибки = ККСНГ_ЭлектроннаяПодписьКлиентСервер.ОшибкиСертификатаКлючаЭП();
	ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(РезультатДополнения.Журнал);
	Если ПоследняяОшибка <> Неопределено Тогда
		ПрерватьСоздание = ПоследняяОшибка.КодОшибки = ОбрабатываемыеОшибки["ОшибкаЗапросаАктивногоСертификата"];
		ТекстОшибкиСертификата = ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
	КонецЕсли;
	УстановитьКартинкуЭтапаНастроек("ПолучениеСертификатаЭП", ТекстОшибкиСертификата, Не ПрерватьСоздание);
	Если ПрерватьСоздание Тогда
		Возврат;
	Иначе 
		ТекстВопроса = ТекстОшибкиСертификата + Символы.ПС + "Продолжить создание организации?";
		ПослеОтветаНаВопрос = Новый ОписаниеОповещения("ЗавершитьШаг1", ЭтотОбъект);
		ПоказатьВопрос(ПослеОтветаНаВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеНастройкиСертификатаЭП(ПовторитьПопытку, ДопПараметры) Экспорт 
	
	РезультатДополнения = ДопПараметры.РезультатДополнения;
	ПрежнийКодОшибки = ДопПараметры.ПрежнийКодОшибки;
		
	Если ПовторитьПопытку = Истина Тогда
		
		НайтиСертификатЭП(ПрежнийКодОшибки);
				
	Иначе 
		ОбработатьОшибкуПолученияСертификатаЭП(РезультатДополнения);		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьШаг1(Знач Ответ = Неопределено, ДопПараметры = Неопределено) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Организация1С = ОрганизацияПоИННКПП(ИНН, КПП);
		ПрежнийКлючДоступаAPI = КлючДоступаAPI;
		ПрежнийСпособАвторизации = СпособАвторизации;
		ПерейтиНаСтраницу(Элементы.СтраницаШаг2);		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШаг2()
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Организация1С) Тогда 
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите, пожалуйста, организацию 1С.", , "Организация1С");
	Иначе
		ПерейтиНаСтраницу(Элементы.СтраницаШаг3);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШаг3()
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(ВариантНастройкиОбмена) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите, пожалуйста, вариант настройки обмена.", , "ВариантНастройкиОбмена");
		Возврат;
	КонецЕсли;
	
	Состояние("Получение идентификатора подписки");
	ТекстОшибкиИдентификатораПодписки = "";
	ИдентификаторПодпискиПолучен = ПолученИдентификаторПодписки(ПараметрыАвторизации, ИдентификаторПодпискиСК, ТекстОшибкиИдентификатораПодписки);
	Если ИдентификаторПодпискиПолучен Тогда
		Состояние("Получение подписки успешно получен.");
	Иначе
		ТекстОшибки = ТекстОшибкиИдентификатораПодписки + Символы.ПС + "Запись организации прервана.";
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ТекстОшибкиЗаписи = "";
	НоваяОрганизацияСсылка = СсылкаЗаписаннойОрганизации(ТекстОшибкиЗаписи);
	Если ЗначениеЗаполнено(НоваяОрганизацияСсылка) Тогда
		ПараметрыФормы = Новый Структура("Ключ,ОткрытаМастеромОрганизации", НоваяОрганизацияСсылка, Истина);
		ОткрытьФорму("Справочник.ККСНГ_Организации.Форма.ФормаЭлемента", ПараметрыФормы, , , , , , РежимОткрытияОкнаФормы.Независимый);
		ОповеститьОбИзменении(НоваяОрганизацияСсылка);
		ККСНГ_ДокументооборотКлиент.ОбновитьПараметрыАвторизацииОрганизации(НоваяОрганизацияСсылка, ПараметрыАвторизации);
		ЭтотОбъект.Закрыть();
	Иначе
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибкиЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда)
		
	ПерейтиНаСтраницу(Элементы["СтраницаШаг" + (Число(НомерТекущегоШага()) - 1)]);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособАвторизацииПриИзменении(Элемент)
	НастроитьВидимостьПоСпособуАвторизации();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнтерфейсныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьВидимостьПоСпособуАвторизации()
	
	ЭтоApiKey = ЭтоАвторизацияApiKey();
	Элементы.КлючДоступаAPI.Видимость = ЭтоApiKey;
	Элементы.ГруппаПолучениеСертификатаЭП.Видимость = ЭтоApiKey;
		
КонецПроцедуры

&НаКлиенте
Функция ЭтоАвторизацияApiKey()
	
	Возврат СпособАвторизации = ПредопределенноеЗначение("Перечисление.ККСНГ_СпособыАвторизацииКурьер.ApiKey");

КонецФункции

&НаКлиенте
Процедура ОтобразитьИННКППКурьер()
	
	ЕстьИНН = ЗначениеЗаполнено(ИНН);
	ЕстьКПП = ЗначениеЗаполнено(КПП);
	Если ЕстьИНН Тогда
		ИННКППКурьера = "ИНН" + ?(ЕстьКПП, " / КПП", "") + " из сервиса ЭДО: " + ИНН + ?(ЕстьКПП, " / " + КПП, "");
	Иначе
	    ИННКППКурьера = "";
	КонецЕсли;
	Элементы.ДекорацияИННКППКурьера.Заголовок = ИННКППКурьера;
	Элементы.ДекорацияИННКППКурьера.Видимость = ЗначениеЗаполнено(ИННКППКурьера);
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьПаузу(ПродолжительностьПаузы = 1, ИмяПроцедурыЗавершения = Неопределено)
	
	Если ЗначениеЗаполнено(ИмяПроцедурыЗавершения) Тогда
		ПодключитьОбработчикОжидания(ИмяПроцедурыЗавершения, ПродолжительностьПаузы, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПустойОбработчик() Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьИнтерфейс()
	
	ОбновитьЗаголовокФормы();
	Элементы.КомандаНазад.Видимость = ИмяТекущейСтраницы() <> "СтраницаШаг1";

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокФормы()
	
	ЭтотОбъект.Заголовок = "Настройка организации для ЭДО: шаг " + НомерТекущегоШага();
	
КонецПроцедуры

&НаКлиенте
Функция НомерТекущегоШага()
	
	Возврат СтрЗаменить(ИмяТекущейСтраницы(), "СтраницаШаг", "");
	
КонецФункции

&НаКлиенте
Функция ИмяТекущейСтраницы()
	
	Возврат Элементы.СтраницыФормы.ТекущаяСтраница.Имя;
	
КонецФункции

&НаКлиенте
Процедура ПерейтиНаСтраницу(НоваяТекСтраница)
	
	Элементы.СтраницыФормы.ТекущаяСтраница = НоваяТекСтраница;
	НастроитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРезультатыСозданияНастроек()
	
	УстановитьКартинкуЭтапаНастроек("Аутентификация", Неопределено);
	УстановитьКартинкуЭтапаНастроек("СведенияОбОрганизации", Неопределено);
	УстановитьКартинкуЭтапаНастроек("ПроверкаУникальности", Неопределено);
	УстановитьКартинкуЭтапаНастроек("ПолучениеСертификатаЭП", Неопределено);
	КодУчастникаЭДО = "";
	ИдентификаторСК = "";
	ИдентификаторПодпискиСК = 0;
	ОтпечатокПодписи = "";
	Сертификат = ПредопределенноеЗначение("Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования.ПустаяСсылка");	
	ИНН = "";
	КПП = "";
	Элементы.ГруппаПолученныеСведенияСВыравниванием.Видимость = Ложь;
	Элементы.ДекорацияНастройкиУспешны.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКартинкуЭтапаНастроек(ИмяЭтапа, ОписаниеОшибки = Неопределено, ЭтоПредупреждение = Ложь)
	
	ЭлементКартинка = Элементы[ИмяЭтапа + "Картинка"];
		
	Если ОписаниеОшибки = Неопределено Тогда
		ЭлементКартинка.Картинка    = Новый Картинка;
		ЭлементКартинка.Подсказка   = НСтр("ru = 'Этап не выполнялся.'");
	ИначеЕсли ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ЭлементКартинка.Картинка    = ?(ЭтоПредупреждение = Истина, БиблиотекаКартинок.ККСНГ_Предупреждение32, БиблиотекаКартинок.ККСНГ_Ошибка32);
		ЭлементКартинка.Подсказка   = ОписаниеОшибки;
	Иначе
		ЭлементКартинка.Картинка    = БиблиотекаКартинок.ККСНГ_Успешно32;
		ЭлементКартинка.Подсказка   = НСтр("ru = 'Этап успешно пройден.'");
	КонецЕсли;
	Элементы.ДекорацияОшибка.Видимость = ЗначениеЗаполнено(ОписаниеОшибки);
	Элементы.ДекорацияОшибка.Заголовок = ?(ЗначениеЗаполнено(ОписаниеОшибки), ОписаниеОшибки, "");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦветЭлементовСогласноВариантуОтправки();
	
	ПоОтдельности = СтрНайти(ВариантНастройкиОбмена, "для каждого документа") <> 0;
	Комплектом = СтрНайти(ВариантНастройкиОбмена, "для комплекта документов") <> 0;
	
	ИнойЦвет = Новый Цвет(0, 150, 70);
	ЦветАвто = Новый Цвет;
	// Элементы варианта "По отдельности".
	Элементы.НадписьАктНаПередачуПравУПД.ЦветТекста = ?(ПоОтдельности, ИнойЦвет, ЦветАвто);
	Элементы.НадписьАктВыполненныхРаботУПД.ЦветТекста = ?(ПоОтдельности, ИнойЦвет, ЦветАвто);
	Элементы.НадписьТоварнаяНакладнаяУПД.ЦветТекста = ?(ПоОтдельности, ИнойЦвет, ЦветАвто);
	Элементы.НадписьСчетФактураУПД.ЦветТекста = ?(ПоОтдельности, ИнойЦвет, ЦветАвто);
	Элементы.НадписьАктНакладнаяКорректировкаУКД.ЦветТекста = ?(ПоОтдельности, ИнойЦвет, ЦветАвто);
	Элементы.НадписьСчетФактураКорректировкаУКД.ЦветТекста = ?(ПоОтдельности, ИнойЦвет, ЦветАвто);
	// Элементы варианта "Комплектом".
	Элементы.НадписьУПДСЧФДОП.ЦветТекста = ?(Комплектом, ИнойЦвет, ЦветАвто);
	Элементы.НадписьУКДСЧФДОП.ЦветТекста = ?(Комплектом, ИнойЦвет, ЦветАвто);
	
КонецПроцедуры

// ИнтерфейсныеПроцедурыИФункции
#КонецОбласти

#Область ВызовМетодовСФЕРАКурьер

&НаКлиенте
Процедура НачатьАутентификацию()
	
	ДанныеАвторизации = Новый Структура("СпособАвторизации,КлючДоступаAPI,ПараметрыАвторизации",
									СпособАвторизации, КлючДоступаAPI, ПараметрыАвторизации);
	ЗавершениеАутентификации = Новый ОписаниеОповещения("ЗавершениеАутентификации", ЭтотОбъект);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииНовойОрганизации(ДанныеАвторизации, ЗавершениеАутентификации);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеАутентификации(Результат, ДополнительныеПараметры) Экспорт
	
	ВозвращаемыйРезультат = Новый Структура("Успех,ТекстОшибки,ПараметрыАвторизации", Ложь, "");
	ВозвращаемыйРезультат.Успех = Результат.Успех;
	
	Если Результат.Успех Тогда
		ВозвращаемыйРезультат.ПараметрыАвторизации = Результат.Результат;		
	Иначе 
		ТекстОшибки = "Не удалось авторизоваться. " + ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(Результат.Журнал);
		ВозвращаемыйРезультат.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

	ПродолжитьОбработкуШага1(ВозвращаемыйРезультат);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолученыСведенияОбОрганизации(ПараметрыАвторизации)	
	
	ВозвращаемыйРезультат = Новый Структура("Успех,ТекстОшибки,КодУчастникаЭДО,НаименованиеОрганизации,ИдентификаторСК,ИНН,КПП", Ложь, "");
	
	РезультатВызова = ККСНГ_APIКурьер.v2_ClientSelf(ПараметрыАвторизации);
	ВозвращаемыйРезультат.Успех = РезультатВызова.Успех;
	
	Если РезультатВызова.Успех Тогда
		Company = РезультатВызова.Результат;
		ВозвращаемыйРезультат.КодУчастникаЭДО = Company.Code;
		ВозвращаемыйРезультат.ИдентификаторСК = Company.Id;	
		ВозвращаемыйРезультат.НаименованиеОрганизации = Company.Name;
		ВозвращаемыйРезультат.ИНН = Company.Inn;	
		ВозвращаемыйРезультат.КПП = Company.Kpp;
	Иначе	
		ВозвращаемыйРезультат.ТекстОшибки = "Не удалось получить информацию о компании. "
										+ ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(РезультатВызова.Журнал);
	КонецЕсли;
	
	Возврат ВозвращаемыйРезультат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолученИдентификаторПодписки(ПараметрыАвторизации, ИдентификаторПодпискиСК, ТекстОшибки = "")		
		
	РезультатВызова = ККСНГ_ДокументооборотВызовСервера.ПолучитьИдентификаторПодписки(ИдентификаторПодпискиСК, ПараметрыАвторизации);
	
	Если РезультатВызова.Успех Тогда
		ИдентификаторПодпискиСК = РезультатВызова.Результат;
		Возврат Истина;
	Иначе
		ТекстОшибки = ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(РезультатВызова.Журнал, "SC-00001");
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

// ВызовМетодовСФЕРАКурьер
#КонецОбласти

&НаСервереБезКонтекста
Функция УникальностьОрганизацииСфераКурьер(ИдентификаторСК)	
	
	ВозвращаемыйРезультат = Новый Структура("Успех,Ссылка,Представление", Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ККСНГ_Организации.Ссылка КАК Ссылка,
		|	ККСНГ_Организации.Представление КАК Представление
		|ИЗ
		|	Справочник.ККСНГ_Организации КАК ККСНГ_Организации
		|ГДЕ
		|	ККСНГ_Организации.ИдентификаторСК = &ИдентификаторСК
		|	И НЕ ККСНГ_Организации.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ИдентификаторСК", ИдентификаторСК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ВозвращаемыйРезультат.Успех = Ложь;
		ЗаполнитьЗначенияСвойств(ВозвращаемыйРезультат, ВыборкаДетальныеЗаписи, "Ссылка,Представление");
	КонецЕсли;
		
	Возврат ВозвращаемыйРезультат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОрганизацияПоИННКПП(ИНН, КПП)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК НайденнаяОрганизация
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления
		|	И Организации.ИНН = &ИНН";
	
	Если ЗначениеЗаполнено(КПП) Тогда
		Запрос.Текст = Запрос.Текст + "
			|	И Организации.КПП = &КПП";
		Запрос.УстановитьПараметр("КПП", КПП);
	КонецЕсли;
	Запрос.УстановитьПараметр("ИНН", ИНН);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи.НайденнаяОрганизация;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СсылкаЗаписаннойОрганизации(ТекстОшибки = "")	
	
	НоваяОрганизация = Справочники.ККСНГ_Организации.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НоваяОрганизация, ЭтотОбъект);
	НоваяОрганизация.Организация = Организация1С;
	
	НоваяОрганизация.ДополнительныеСвойства.Вставить("Склад", ЭтотОбъект.Склад);
		
	Попытка
		НоваяОрганизация.Записать();
	Исключение
	    ТекстОшибки = "Не удалось записать организацию по причине: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат НоваяОрганизация.Ссылка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстПредупрежденияОрганизация(Организация1С, ЭталонныйИНН, ЭталонныйКПП)
	
	ТекстПредупреждения = "";
	ИННСовпадают = Организация1С.ИНН = ЭталонныйИНН;
	КППСовпадают = Организация1С.КПП = ЭталонныйКПП;
	
	Если Не ИННСовпадают И Не КППСовпадают Тогда 
		ТекстПредупреждения = "ИНН и КПП выбранной организации не совпадают с данными из сервиса ЭДО.";
	ИначеЕсли Не ИННСовпадают Тогда
		ТекстПредупреждения = "ИНН выбранной организации не совпадает с данными из сервиса ЭДО.";
	ИначеЕсли Не КППСовпадают Тогда
		ТекстПредупреждения = "КПП выбранной организации не совпадает с данными из сервиса ЭДО.";
	Иначе	// Все хорошо. 
		ТекстПредупреждения = "";
	КонецЕсли;
	
	Возврат ТекстПредупреждения;
	
КонецФункции

#КонецОбласти
